app/controllers/equipos_controller.rb

SELECT "equipos".* FROM "equipos"
---
  def index
    @equipos = Equipo.all

INSERT INTO "equipos" ("IdEquipo", "Placa", "Modelo", "Serie", "Marca", "IdEstadoEquipo", "IdTipoEquipo", "IdArea", "eliminado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @equipo = Equipo.new(equipo_params)

    respond_to do |format|
      if @equipo.save

SELECT  "equipos".* FROM "equipos" WHERE "equipos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_equipo
      @equipo = Equipo.find(params[:id])