app/controllers/facturas_controller.rb

  def index
    @facturas = Factura.all
---
SELECT "facturas".* FROM "facturas"

  def create
    @factura = Factura.new(factura_params)

    respond_to do |format|
      if @factura.save
---
INSERT INTO "facturas" ("IdFacturas", "NumFactura", "Fecha", "Concepto", "Valor", "ComentarioFactura", "IdEstadoFactura", "eliminado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_factura
      @factura = Factura.find(params[:id])
---
SELECT  "facturas".* FROM "facturas" WHERE "facturas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]